"""
from runoob.com get 100Python eg
20180419 19:40
SunJian
"""
import requests
from bs4 import BeautifulSoup


def get_html(url):
    html = ""
    try:
        html = requests.get(url)
        html.encoding = html.apparent_encoding
    except Exception as e:
        print("error!")
        print(e)
    return html.text


def parse_data(html):
    soup = BeautifulSoup(html, "html.parser")
    num = soup.find("div", attrs={"class": "article-intro"}).find("h1").text

    results = soup.select('div[class="article-intro"] p')
    title = results[1].text

    print(num, "-----", title)


if __name__ == '__main__':
    ex_num = 1

    while ex_num <= 100:
        url = "http://www.runoob.com/python/python-exercise-example" + str(ex_num) + ".html"
        html = get_html(url)
        parse_data(html)
        ex_num = ex_num+1


'''
Python 练习实例1 ----- 题目：有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
Python 练习实例2 ----- 题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
Python 练习实例3 ----- 题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
Python 练习实例4 ----- 题目：输入某年某月某日，判断这一天是这一年的第几天？
Python 练习实例5 ----- 题目：输入三个整数x,y,z，请把这三个数由小到大输出。
Python 练习实例6 ----- 题目：斐波那契数列。 
Python 练习实例7 ----- 题目：将一个列表的数据复制到另一个列表中。
Python 练习实例8 ----- 题目：输出 9*9 乘法口诀表。
Python 练习实例9 ----- 题目：暂停一秒输出。 
Python 练习实例10 ----- 题目：暂停一秒输出，并格式化当前时间。 
Python 练习实例11 ----- 题目：古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？ 
Python 练习实例12 ----- 题目：判断101-200之间有多少个素数，并输出所有素数。
Python 练习实例13 ----- 题目：打印出所有的"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该数本身。例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。
Python 练习实例14 ----- 题目：将一个正整数分解质因数。例如：输入90,打印出90=2*3*3*5。
Python 练习实例15 ----- 题目：利用条件运算符的嵌套来完成此题：学习成绩>=90分的同学用A表示，60-89分之间的用B表示，60分以下的用C表示。
Python 练习实例16 ----- 题目：输出指定格式的日期。
Python 练习实例17 ----- 题目：输入一行字符，分别统计出其中英文字母、空格、数字和其它字符的个数。
Python 练习实例18 ----- 题目：求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。例如2+22+222+2222+22222(此时共有5个数相加)，几个数相加由键盘控制。
Python 练习实例19 ----- 题目：一个数如果恰好等于它的因子之和，这个数就称为"完数"。例如6=1＋2＋3.编程找出1000以内的所有完数。
Python 练习实例20 ----- 题目：一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
Python 练习实例21 ----- 题目：猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，又多吃了一个第二天早上又将剩下的桃子吃掉一半，又多吃了一个。以后每天早上都吃了前一天剩下的一半零一个。到第10天早上想再吃时，见只剩下一个桃子了。求第一天共摘了多少。
Python 练习实例22 ----- 题目：两个乒乓球队进行比赛，各出三人。甲队为a,b,c三人，乙队为x,y,z三人。已抽签决定比赛名单。有人向队员打听比赛的名单。a说他不和x比，c说他不和x,z比，请编程序找出三队赛手的名单。 
Python 练习实例23 ----- 题目：打印出如下图案（菱形）:
Python 练习实例24 ----- 题目：有一分数序列：2/1，3/2，5/3，8/5，13/8，21/13...求出这个数列的前20项之和。
Python 练习实例25 ----- 题目：求1+2!+3!+...+20!的和。
Python 练习实例26 ----- 题目：利用递归方法求5!。
Python 练习实例27 ----- 题目：利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。
Python 练习实例28 ----- 题目：有5个人坐在一起，问第五个人多少岁？他说比第4个人大2岁。问第4个人岁数，他说比第3个人大2岁。问第三个人，又说比第2人大两岁。问第2个人，说比第一个人大两岁。最后问第一个人，他说是10岁。请问第五个人多大？
Python 练习实例29 ----- 题目：给一个不多于5位的正整数，要求：一、求它是几位数，二、逆序打印出各位数字。
Python 练习实例30 ----- 题目：一个5位数，判断它是不是回文数。即12321是回文数，个位与万位相同，十位与千位相同。
Python 练习实例31 ----- 题目：请输入星期几的第一个字母来判断一下是星期几，如果第一个字母一样，则继续判断第二个字母。
Python 练习实例32 ----- 题目：按相反的顺序输出列表的值。
Python 练习实例33 ----- 题目：按逗号分隔列表。
Python 练习实例34 ----- 题目：练习函数调用。
Python 练习实例35 ----- 题目：文本颜色设置。
Python 练习实例36 ----- 题目：求100之内的素数。
Python 练习实例37 ----- 题目：对10个数进行排序。
Python 练习实例38 ----- 题目：求一个3*3矩阵主对角线元素之和。
Python 练习实例39 ----- 题目：有一个已经排好序的数组。现输入一个数，要求按原来的规律将它插入数组中。
Python 练习实例40 ----- 题目：将一个数组逆序输出。
Python 练习实例41 ----- 题目：模仿静态变量的用法。
Python 练习实例42 ----- 题目：学习使用auto定义变量的用法。
Python 练习实例43 ----- 题目：模仿静态变量(static)另一案例。
Python 练习实例44 - Python 两个矩阵相加 ----- 两个 3 行 3 列的矩阵，实现其对应位置的数据相加，并返回一个新矩阵：
Python 练习实例45 ----- 题目：统计 1 到 100 之和。
Python 练习实例46 ----- 题目：求输入数字的平方，如果平方运算后小于 50 则退出。
Python 练习实例47 ----- 题目：两个变量值互换。
Python 练习实例48 ----- 题目：数字比较。
Python 练习实例49 ----- 题目：使用lambda来创建匿名函数。
Python 练习实例50 ----- 题目：输出一个随机数。
Python 练习实例51 ----- 题目：学习使用按位与 & 。
Python 练习实例52 ----- 题目：学习使用按位或 | 。
Python 练习实例53 ----- 题目：学习使用按位异或 ^ 。
Python 练习实例54 ----- 题目：取一个整数a从右端开始的4〜7位。
Python 练习实例55 ----- 题目：学习使用按位取反~。
Python 练习实例56 ----- 题目：画图，学用circle画圆形。　　　
Python 练习实例57 ----- 题目：画图，学用line画直线。
Python 练习实例58 ----- 题目：画图，学用rectangle画方形。　　　
Python 练习实例59 ----- 题目：画图，综合例子。　　
Python 练习实例60 ----- 题目：计算字符串长度。　　
Python 练习实例61 ----- 题目：打印出杨辉三角形（要求打印出10行如下图）。　　
Python 练习实例62 ----- 题目：查找字符串。　　
Python 练习实例63 ----- 题目：画椭圆。　
Python 练习实例64 ----- 题目：利用ellipse 和 rectangle 画图。。　
Python 练习实例65 ----- 题目：一个最优美的图案。　　
Python 练习实例66 ----- 题目：输入3个数a,b,c，按大小顺序输出。　　　
Python 练习实例67 ----- 题目：输入数组，最大的与第一个元素交换，最小的与最后一个元素交换，输出数组。
Python 练习实例68 ----- 题目：有n个整数，使其前面各数顺序向后移m个位置，最后m个数变成最前面的m个数
Python 练习实例69 ----- 题目：有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），凡报到3的人退出圈子，问最后留下的是原来第几号的那位。
Python 练习实例70 ----- 题目：写一个函数，求一个字符串的长度，在main函数中输入字符串，并输出其长度。
Python 练习实例71 ----- 题目：编写input()和output()函数输入，输出5个学生的数据记录。
Python 练习实例72 ----- 题目：创建一个链表。
Python 练习实例73 ----- 题目：反向输出一个链表。
Python 练习实例74 ----- 题目：列表排序及连接。
Python 练习实例75 ----- 题目：放松一下，算一道简单的题目。
Python 练习实例76 ----- 题目：编写一个函数，输入n为偶数时，调用函数求1/2+1/4+...+1/n,当输入n为奇数时，调用函数1/1+1/3+...+1/n
Python 练习实例77 ----- 题目：循环输出列表
Python 练习实例78 ----- 题目：找到年龄最大的人，并输出。请找出程序中有什么问题。
Python 练习实例79 ----- 题目：字符串排序。
Python 练习实例80 ----- 题目：海滩上有一堆桃子，五只猴子来分。第一只猴子把这堆桃子平均分为五份，多了一个，这只猴子把多的一个扔入海中，拿走了一份。第二只猴子把剩下的桃子又平均分成五份，又多了一个，它同样把多的一个扔入海中，拿走了一份，第三、第四、第五只猴子都是这样做的，问海滩上原来最少有多少个桃子？
Python 练习实例81 ----- 题目：809*??=800*??+9*?? 其中??代表的两位数, 809*??为四位数，8*??的结果为两位数，9*??的结果为3位数。求??代表的两位数，及809*??后的结果。
Python 练习实例82 ----- 题目：八进制转换为十进制
Python 练习实例83 ----- 题目：求0—7所能组成的奇数个数。
Python 练习实例84 ----- 题目：连接字符串。
Python 练习实例85 ----- 题目：输入一个奇数，然后判断最少几个 9 除于该数的结果为整数。
Python 练习实例86 ----- 题目：两个字符串连接程序。
Python 练习实例87 ----- 题目：回答结果（结构体变量传递）。
Python 练习实例88 ----- 题目：读取7个数（1—50）的整数值，每读取一个值，程序打印出该值个数的＊。
Python 练习实例89 ----- 题目：某个公司采用公用电话传递数据，数据是四位的整数，在传递过程中是加密的，加密规则如下：每位数字都加上5,然后用和除以10的余数代替该数字，再将第一位和第四位交换，第二位和第三位交换。
Python 练习实例90 ----- 题目：列表使用实例。
Python 练习实例91 ----- 题目：时间函数举例1。
Python 练习实例92 ----- 题目：时间函数举例2。
Python 练习实例93 ----- 题目：时间函数举例3。
Python 练习实例94 ----- 题目：时间函数举例4,一个猜数游戏，判断一个人反应快慢。
Python 练习实例95 ----- 题目：字符串日期转换为易读的日期格式。
Python 练习实例96 ----- 题目：计算字符串中子串出现的次数。
Python 练习实例97 ----- 题目：从键盘输入一些字符，逐个把它们写到磁盘文件上，直到输入一个 # 为止。
Python 练习实例98 ----- 题目：从键盘输入一个字符串，将小写字母全部转换成大写字母，然后输出到一个磁盘文件"test"中保存。 
Python 练习实例99 ----- 题目：有两个磁盘文件A和B,各存放一行字母,要求把这两个文件中的信息合并(按字母顺序排列), 输出到一个新文件C中。 
Python 练习实例100 ----- 题目：列表转换为字典。 
'''