# print("你好")

# while( True ):循环的一种

# for循环
# i 在10范围内
# sum = 0
# for i in range( 9 ,24 ,2 ) :
#     sum = sum + i
#
# print(sum)

# 计算9+10+。。。。。23，结果是多少


# continue：继续
# break：结束循环
# 我害怕50这个数，看见就晕倒
# list = ["张三","李四","王五","赵六","丁七"]
#输出这些人的名字，如果遇到孙悟空，就喊齐天大剩，然后后边人名不输出

# for i in range( 100 ):
#     if( list[i] == "孙悟空" ):
#         print("齐天大圣")
#         break
#     print(list[i])

# *
# **
# ***
# ****

# 循环嵌套，
# for j in range(4):
#     for i in range(4):
#         print("*",end="")
#     print()#换行

# 作业1
# *
# * *
# *  *
# *   *

# 作业2
# 1
# 1 2
# 1 2 3
# 1 2 3 4

# 作业3
# 输出乘法口诀表
# 1*1=1
# 1*2=2 2*2=4
# 1*3=3 2*3=6 3*3=9


# 初识函数

# 函数：包裹一段代码，使之成为一个整体，使用的时候直接调用即可

# 定义函数：函数名为fun
#函数需要调用才能生效，不调用，绝不生效
#参数：是我们使用函数，给函数的一个值
def fun( a , b ) :
    for j in range(a):
        for i in range(b):
            print("*", end="")
        print()  # 换行

6*8
fun(6,8)
print("----------------")
9*3
fun(9,3)
print("----------------")
15*4
fun(15,4)
print("----------------")
fun(10,10)
# 现在我们的样例，特别简单



# 专业知识，行业，读大学，明灯，人生导师
# 1.捧着唠，
# 2.看起来特别努力

# 输出0-N，放到函数里，通过参数指定输出到多少