#Pyton弱类型的语言
#什么类型不知道，运行的时候再说


#C，C++,JAVA强类型的语言，
#运行之前就需要说明，你是什么类型的数据

#单行注释，解释，说明代码的文字，不起任何作用

'''
多行注释
全都是注释

'''
'''
#变量
#数学+英语的视角

#变量
a = 10
A = 20

#关键字不能做变量名
#for = 90

a = 1
b = 1.1
#c = 1+3i

print(a)
#字符串
str1 = "你好，世界！！我好，他好！ds■☹♂○▊▉█▁▂▃▄▅"
print(str1)

str2 = "当我们描述对话的时候\t张三say:\a'how are you\""
print(str2)

name1 = "张三丰\t国花田\t王五\t赵六"
name2 = "丁七\t钱九门\t周十\t小明"
print(name1)
print(name2)

#更新单个字符
name3 = "小铭"
list = list(name3)
list[1] = "明"
name3 = "".join(list)
print(name3)

s1 = "长春"
s2 = "吉大附中"
s3 = "实验学校"
# + 符号表示拼接，因为字符串无法进行加法运算
print(s1+s2+s3)

#重复输出
s4 = s1*4
print(s4*4)

#人-机交互，键盘输入一个值
money = input("你月薪是多少（￥）")

print(money+"是我的月薪！")
'''
#格式化输出

#   %o —— oct 八进制
#   %d —— dec 十进制
#   %x —— hex 十六进制
print('%o' % 20)
print('%d' % 20)
print('%x' % 20)

'''
%f ——保留小数点后面六位有效数字
　　%.3f，保留3位小数位
%e ——保留小数点后面六位有效数字，指数形式输出
　　%.3e，保留3位小数位，使用科学计数法
%g ——在保证六位有效数字的前提下，使用小数方式，否则使用科学计数法
　　%.3g，保留3位有效数字，使用小数或科学计数法
'''
print('%f' % 1.11)  # 默认保留6位小数

print('%.1f' % 1.11)  # 取1位小数

print('%e' % 1234.11)  # 默认6位小数，用科学计数法

print('%.3e' % 1.11)  # 取3位小数，用科学计数法

print('%g' % 1111.1111)  # 默认6位有效数字

print('%.7g' % 1111.1111)  # 取7位有效数字

print('%.2g' % 1111.1111)  # 取2位有效数字，自动转换为科学计数法




#格式化输出字符串

str = "tommmm";

str1 = "K";


print("%10s" % str)
print("%-10s" % str1)


s = "美利坚合众国"
print("%10.2s"%s)


#字符串匹配
str = "打东边来了个{0},打西边来了个{1}"
print(str.format("小明","小刚"))


#字符串截取
s = "美利坚合众国"
print( s[2] )
print( s[2:] )
print( s[0:5] )
print( s[0:5:2] )

print(s[-2])

print("美" not in s)
